scripts/perf-tests/artillery-config.yml
# Artillery Performance Test Configuration
# Tests the Bharat Mandi AWS deployment

config:
  target: "http://13.236.3.139:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Normal load
    - duration: 120
      arrivalRate: 20
      name: "Normal load"
    
    # Peak load
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    
    # Stress test
    - duration: 60
      arrivalRate: 100
      name: "Stress test"
  
  # processor: "./artillery-processor.js"  # Disabled for now
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 1000        # 95th percentile < 1000ms
    p99: 2000        # 99th percentile < 2000ms

scenarios:
  # Test 1: Health Check
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # Test 2: Get Marketplace Listings
  - name: "Browse Marketplace"
    weight: 40
    flow:
      - get:
          url: "/api/marketplace/listings"
          expect:
            - statusCode: 200
            - contentType: json

  # Test 3: Get Specific Listing
  - name: "View Listing Details"
    weight: 30
    flow:
      - get:
          url: "/api/marketplace/listings"
      - think: 2
      - get:
          url: "/api/marketplace/listings/{{ $randomString() }}"
          # Will return 404 for random IDs, but tests the endpoint

  # Test 4: Translation API
  - name: "Translation Request"
    weight: 20
    flow:
      - post:
          url: "/api/i18n/translate"
          json:
            text: "Hello, how are you?"
            targetLanguage: "hi"
          expect:
            - statusCode: 200
            - contentType: json